"""
Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
они сделали S журавликов. Сколько журавликов сделал каждый
ребенок, если известно, что Петя и Сережа сделали одинаковое
количество журавликов, а Катя сделала в два раза больше журавликов,
чем Петя и Сережа вместе?

Пример:
6 -> 1 4 1
24 -> 4 16 4
60 -> 10 40 10
"""
a = int(input("Введите общее колличество журавликов "))

if a < 1:
   a *= -1
if a==0:
   a = int(input("Введите любое число, кроме нуля "))
if a==0:
  print("Вы ввели ни корректное число, запустите программу заново")
  exit()

b = a//3//2
c = b*4
print(f"Петя и Сережа сделали по {b} журавля а Катя сделала {c}")

"""
Альтернативное решение
n1 = n // 6
n2 = n // 6
n3 = (n // 6) * 4
print(n1, n3, n2)
"""